{"class_name": "Sequential", "config": [{"class_name": "Masking", "config": {"trainable": true, "dtype": "float32", "batch_input_shape": [null, 5, 6], "name": "masking_1", "mask_value": -1}}, {"class_name": "LSTM", "config": {"return_sequences": false, "return_state": false, "units": 32, "recurrent_regularizer": null, "unit_forget_bias": true, "trainable": true, "implementation": 1, "stateful": false, "recurrent_activation": "hard_sigmoid", "dropout": 0.2, "kernel_regularizer": null, "activity_regularizer": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "bias_constraint": null, "go_backwards": false, "unroll": false, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "tanh", "name": "lstm_1", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true}}, {"class_name": "Dense", "config": {"activation": "linear", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "dtype": "float32", "batch_input_shape": [null, 32], "name": "dense_1", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "units": 3}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "softmax"}}], "backend": "tensorflow", "keras_version": "2.1.6"}