{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Masking", "config": {"batch_input_shape": [null, 5, 44], "mask_value": -1, "name": "masking_1", "trainable": true, "dtype": "float32"}}, {"class_name": "LSTM", "config": {"implementation": 1, "recurrent_regularizer": null, "dropout": 0.2, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "units": 32, "activity_regularizer": null, "bias_regularizer": null, "activation": "tanh", "recurrent_dropout": 0.0, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "unroll": false, "return_state": false, "name": "lstm_1", "kernel_regularizer": null, "return_sequences": false, "go_backwards": false}}, {"class_name": "Dense", "config": {"batch_input_shape": [null, 32], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "dtype": "float32", "trainable": true, "units": 11, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_1", "use_bias": true, "activation": "linear", "bias_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "softmax"}}], "keras_version": "2.1.6"}