{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.6", "config": [{"class_name": "Masking", "config": {"trainable": true, "batch_input_shape": [null, 5, 14], "mask_value": -1, "name": "masking_1", "dtype": "float32"}}, {"class_name": "LSTM", "config": {"units": 32, "return_state": false, "return_sequences": false, "go_backwards": false, "activity_regularizer": null, "dropout": 0.2, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "name": "lstm_1", "recurrent_dropout": 0.0, "kernel_regularizer": null, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "implementation": 1, "trainable": true, "bias_constraint": null, "stateful": false, "unit_forget_bias": true, "activation": "tanh", "bias_regularizer": null, "recurrent_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"units": 7, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "linear", "name": "dense_1", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "batch_input_shape": [null, 32], "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_1"}}]}