{"keras_version": "2.1.6", "backend": "tensorflow", "config": [{"config": {"name": "masking_1", "mask_value": -1, "dtype": "float32", "trainable": true, "batch_input_shape": [null, 5, 11]}, "class_name": "Masking"}, {"config": {"recurrent_dropout": 0.0, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "go_backwards": false, "bias_constraint": null, "activity_regularizer": null, "implementation": 1, "name": "lstm_1", "stateful": false, "unit_forget_bias": true, "bias_regularizer": null, "units": 32, "kernel_regularizer": null, "return_sequences": false, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "return_state": false, "activation": "tanh", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dropout": 0.2, "recurrent_constraint": null, "recurrent_regularizer": null, "trainable": true, "unroll": false}, "class_name": "LSTM"}, {"config": {"activation": "linear", "kernel_regularizer": null, "bias_constraint": null, "name": "dense_1", "use_bias": true, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 32], "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "units": 6, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential"}